OpenFOAM/WFD_OpenFOAM/cases/batch_004/baseline_pitch_8p5_chord_0p4_0p6_0p25/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 223.52);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (0 0 223.52);
    }

    outlet
    {
        type            inletOutlet;
        inletValue      uniform (0 0 223.52);
        value           uniform (0 0 223.52);
    }

    sideWalls
    {
        type            slip;
    }

    propeller
    {
        type            MRFnoSlip;
        value           uniform (0 0 0);
    }

    #includeEtc "caseDicts/setConstraintTypes"
}

// ************************************************************************* //
