OpenFOAM/WFD_OpenFOAM/cases/batch_004/baseline_pitch_8p5_chord_0p4_0p6_0p25/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    inlet
    {
        type            patch;
        nFaces          576;
        startFace       2188278;
    }
    outlet
    {
        type            patch;
        nFaces          576;
        startFace       2188854;
    }
    sideWalls
    {
        type            patch;
        nFaces          4608;
        startFace       2189430;
    }
    propeller
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          14843;
        startFace       2194038;
    }
)

// ************************************************************************* //
