OpenFOAM/WFD_OpenFOAM/cases/batch_004/baseline_pitch_8p5_chord_0p4_0p6_0p25/system/functions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
propellerForces
{
    type            forces;
    libs            ("libforces.so");

    writeControl    timeStep;
    writeInterval   1;
    log             yes;

    patches         (propeller);

    rho             rho;
    CofR            (0 0 0);
    pitchAxis       (0 0 1);
}
